RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/capsense/cy_capsense_csx_v2.c
    #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_MULTI_FREQUENCY_SCAN_EN)
        if(0u != ptrActive->mfsChannelIndex)
        {
            Cy_CapSense_InitActivePtrSns(ptrActive->sensorIndex, context);
            Cy_CapSense_CSXSetSnsClkFreq(CY_CAPSENSE_MFS_CH0_INDEX, context);
        }
    #endif

    Cy_CapSense_CSXStartSample(context);
}


#if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSX_CALIBRATION_EN)
/*******************************************************************************
* Function Name: Cy_CapSense_CSXCalibrateWidget
****************************************************************************//**
*
* Executes the IDAC calibration for all the sensors in the widget specified in
* the input.
*
* \deprecated This function is obsolete and kept for backward compatibility only.
* The Cy_CapSense_CalibrateWidget() function should be used instead.
*
* Performs a successive approximation search algorithm to find appropriate
* IDAC values for all sensors in the specified widget that provide
* the raw count to the level specified by the target parameter.
*
* Calibration returns CY_CAPSENSE_STATUS_BAD_DATA if the achieved raw count is outside
* of the range specified by the target and acceptable calibration deviation
* parameters.
*
* This function could be used when the CSX Enable IDAC auto-calibration
* parameter is enabled.
*
* \param widgetId
* Specifies the ID number of the widget. A macro for the widget ID can be found
* in the cycfg_capsense.h file defined as CY_CAPSENSE_<WIDGET_NAME>_WDGT_ID.
*
* \param target
* Specifies the calibration target in percentages of the maximum raw count.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
* \return
* Returns the status of the specified widget calibration:
* - CY_CAPSENSE_STATUS_SUCCESS       - The operation is successfully completed.
* - CY_CAPSENSE_STATUS_BAD_PARAM     - The input parameter is invalid.
* - CY_CAPSENSE_STATUS_BAD_DATA      - The calibration failed and CAPSENSE&trade; may not operate
*                         as expected.
* - CY_CAPSENSE_STATUS_INVALID_STATE - The previous scanning is not completed, and
*                         the CAPSENSE&trade; middleware is busy.
*
*******************************************************************************/
cy_capsense_status_t Cy_CapSense_CSXCalibrateWidget(
                uint32_t widgetId,
                uint32_t target,
                cy_stc_capsense_context_t * context)
{
    uint32_t cpuFreqMHz;
    uint32_t watchdogCounter;
    uint32_t freqChIndex;

    cy_capsense_status_t calibrateStatus = CY_CAPSENSE_STATUS_SUCCESS;
    const cy_stc_capsense_widget_config_t * ptrWdCfg;
    cy_stc_capsense_sensor_context_t * ptrActSnsContext;

    uint32_t rawTarget;
    uint32_t totalSns;
    uint32_t modClkDivider;
    uint32_t snsClkDivider;
    uint32_t calibrationIndex;
    /* Currently used IDAC-bit */
    uint8_t curIdacMask = CY_CAPSENSE_CAL_MIDDLE_VALUE;
    /* Next used IDAC-bit */
    uint8_t nextIdacMask = ((uint8_t)CY_CAPSENSE_CAL_MIDDLE_VALUE) >> 1u;

    /* Approximate duration of Wait For Init loop */
    const uint32_t isBusyLoopDuration = 5u;

    /* Wait For Init watchdog timeout in microseconds */
    uint64_t isBusyWatchdogTimeUs = 0u;


    if((context->ptrCommonConfig->numWd <= widgetId) ||
        (CY_CAPSENSE_DISABLE == context->ptrCommonConfig->csxIdacAutocalEn))
    {
        calibrateStatus = CY_CAPSENSE_STATUS_BAD_PARAM;
    }

    if(CY_CAPSENSE_CSX_GROUP != context->ptrWdConfig[widgetId].senseMethod)
    {
        calibrateStatus = CY_CAPSENSE_STATUS_BAD_PARAM;
    }

    if(CY_CAPSENSE_BUSY  == (context->ptrCommonContext->status & CY_CAPSENSE_BUSY))
    {
        /* Previous widget is being scanned, return error */
        calibrateStatus = CY_CAPSENSE_STATUS_INVALID_STATE;
    }

    if(CY_CAPSENSE_STATUS_SUCCESS == calibrateStatus)
    {
        ptrWdCfg = &context->ptrWdConfig[widgetId];
        ptrActSnsContext = ptrWdCfg->ptrSnsContext;
        totalSns = ptrWdCfg->numSns;

        /* Calculate target raw count */
        rawTarget = ((uint32_t)context->ptrWdContext[widgetId].maxRawCount * target) / CY_CAPSENSE_PERCENTAGE_100;

        /* Clear raw count registers and IDAC registers of all the sensors/nodes */
        for(freqChIndex = 0u; freqChIndex < CY_CAPSENSE_CONFIGURED_FREQ_NUM; freqChIndex++)
        {
            /* Clear raw count registers and IDAC registers of all the sensors/nodes */
            for (calibrationIndex = 0u; calibrationIndex < totalSns; calibrationIndex++)
            {
                ptrActSnsContext[calibrationIndex + (freqChIndex * context->ptrCommonConfig->numSns)].raw = 0u;
                ptrActSnsContext[calibrationIndex + (freqChIndex * context->ptrCommonConfig->numSns)].idacComp = curIdacMask;
            }
        }
        modClkDivider = (uint32_t)context->ptrCommonContext->modCsxClk;
        snsClkDivider = (uint32_t)ptrWdCfg->ptrWdContext->snsClk;

        if(0u == modClkDivider)
        {
            modClkDivider = 1u;
        }

        if(0u == snsClkDivider)
        {
            snsClkDivider = 1u;
        }

        #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_MULTI_FREQUENCY_SCAN_EN)
            if(context->ptrCommonConfig->csxMfsDividerOffsetF1 >
               context->ptrCommonConfig->csxMfsDividerOffsetF2)
            {
                snsClkDivider += context->ptrCommonConfig->csxMfsDividerOffsetF1;
            }
            else
            {
                snsClkDivider += context->ptrCommonConfig->csxMfsDividerOffsetF2;
            }

            isBusyWatchdogTimeUs  = (uint64_t)totalSns * CY_CAPSENSE_MAX_SUPPORTED_FREQ_NUM * ptrWdCfg->ptrWdContext->resolution;
        #else
            isBusyWatchdogTimeUs  = (uint64_t)totalSns * ptrWdCfg->ptrWdContext->resolution;
        #endif

        isBusyWatchdogTimeUs *= (uint64_t)snsClkDivider * modClkDivider * CY_CAPSENSE_CONVERSION_MEGA;
        isBusyWatchdogTimeUs /= context->ptrCommonConfig->periClkHz;

        if(0uL == isBusyWatchdogTimeUs)
        {
            isBusyWatchdogTimeUs = 1u;
        }

