RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/capsense/cy_capsense_csx_v2.c
        isBusyWatchdogTimeUs *= CY_CAPSENSE_CSX_WATCHDOG_MARGIN_COEFF;

        /* Perform binary search for accurate IDAC value for each sensor/node */
        do
        {
            /* Scan all the sensors/nodes in widget */
            (void)Cy_CapSense_SetupWidget(widgetId, context);
            (void)Cy_CapSense_Scan(context);

            cpuFreqMHz = context->ptrCommonConfig->cpuClkHz / CY_CAPSENSE_CONVERSION_MEGA;
            watchdogCounter = Cy_CapSense_WatchdogCyclesNum((uint32_t)isBusyWatchdogTimeUs, cpuFreqMHz, isBusyLoopDuration);

            /* Wait for EOS */
            while (CY_CAPSENSE_BUSY  == (context->ptrCommonContext->status & CY_CAPSENSE_BUSY))
            {
                if(0uL == watchdogCounter)
                {
                    break;
                }

                watchdogCounter--;
            }

            /* Set pointer to the widget's first sensor data */
            ptrActSnsContext = ptrWdCfg->ptrSnsContext;

            /* Check raw count and adjust IDAC, loop through all the sensors/nodes */
            for (freqChIndex = 0u; freqChIndex < CY_CAPSENSE_CONFIGURED_FREQ_NUM; freqChIndex++)
            {
                for (calibrationIndex = 0u; calibrationIndex < totalSns; calibrationIndex++)
                {
                    /* Check whether the current raw count is above target.
                    * If yes, clear the MS bit of bit.
                    * If no, keep the MS bit and set next bit.
                    */
                    if (ptrActSnsContext[calibrationIndex + (freqChIndex * context->ptrCommonConfig->numSns)].raw > rawTarget)
                    {
                        ptrActSnsContext[calibrationIndex + (freqChIndex * context->ptrCommonConfig->numSns)].idacComp &= (uint8_t)(~curIdacMask);
                    }
                    ptrActSnsContext[calibrationIndex + (freqChIndex * context->ptrCommonConfig->numSns)].idacComp |= nextIdacMask;
                }
            }

            /* Shift both current IDAC and pre IDAC values to the right by 1 */
            curIdacMask = nextIdacMask;
            nextIdacMask = nextIdacMask >> 1u;
        }
        while (curIdacMask != 0u);
        calibrateStatus = CY_CAPSENSE_STATUS_SUCCESS;
    }

    if(CY_CAPSENSE_STATUS_SUCCESS == calibrateStatus)
    {
        /* Perform specified widget scan to check calibration result */
        /* Scan all the sensors/nodes in widget */
        (void)Cy_CapSense_SetupWidget(widgetId, context);
        (void)Cy_CapSense_Scan(context);

        cpuFreqMHz = context->ptrCommonConfig->cpuClkHz / CY_CAPSENSE_CONVERSION_MEGA;
        watchdogCounter = Cy_CapSense_WatchdogCyclesNum((uint32_t)isBusyWatchdogTimeUs, cpuFreqMHz, isBusyLoopDuration);

        /* Wait for EOS */
        while (CY_CAPSENSE_BUSY  == (context->ptrCommonContext->status & CY_CAPSENSE_BUSY))
        {
            if(0uL == watchdogCounter)
            {
                calibrateStatus = CY_CAPSENSE_STATUS_TIMEOUT;
                break;
            }

            watchdogCounter--;
        }

        if(CY_CAPSENSE_STATUS_SUCCESS == calibrateStatus)
        {
            calibrateStatus = Cy_CapSense_CalibrateCheck(widgetId, target, CY_CAPSENSE_CSX_GROUP, context);
        }
    }

    return(calibrateStatus);
}
#endif /* (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSX_CALIBRATION_EN) */


/*******************************************************************************
* Function Name: Cy_CapSense_CSXSetUpIdacs
****************************************************************************//**
*
* Configures IDAC for the CSX sensing method.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
*******************************************************************************/
void Cy_CapSense_CSXSetUpIdacs(cy_stc_capsense_context_t * context)
{
    uint32_t tmpRegVal;

    /* Set IDAC gain */
    tmpRegVal = context->ptrCommonConfig->idacGainTable[context->ptrActiveScanSns->ptrWdContext->idacGainIndex].gainReg;
    /* Set IDAC code */
    tmpRegVal |= (uint32_t)context->ptrActiveScanSns->ptrSnsContext->idacComp & CY_CAPSENSE_CSD_IDACA_VAL_MSK;
    tmpRegVal |= CY_CAPSENSE_DEFAULT_CSD_IDACA_CFG;

    context->ptrCommonConfig->ptrCsdBase->IDACA = tmpRegVal;
}

/*******************************************************************************
* Function Name: Cy_CapSense_SsCSXStartSample
****************************************************************************//**
*
* Starts scanning for the CSX widget.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
*******************************************************************************/
static void Cy_CapSense_CSXStartSample(cy_stc_capsense_context_t * context)
{
    /* Set up IDAC Value */
    Cy_CapSense_CSXSetUpIdacs(context);

    /* Clear previous interrupts */
    context->ptrCommonConfig->ptrCsdBase->INTR = CY_CAPSENSE_CSD_INTR_ALL_MSK;
    (void)context->ptrCommonConfig->ptrCsdBase->INTR;

    /* Enable interrupt */
    context->ptrCommonConfig->ptrCsdBase->INTR_MASK = CY_CAPSENSE_CSD_INTR_MASK_SAMPLE_MSK;

    if(NULL != context->ptrInternalContext->ptrSSCallback)
    {
        context->ptrInternalContext->ptrSSCallback(context->ptrActiveScanSns);
    }

    Cy_CapSense_CSXStartSampleExt(context);
}


/*******************************************************************************
* Function Name: Cy_CapSense_CSXConnectRx
****************************************************************************//**
*
* Connects port pin (an Rx electrode) to the CSD HW block using AMUX bus.
*
* \deprecated This function is obsolete and kept for backward compatibility only.
* The Cy_CapSense_SetPinState() function should be used instead.
*
* This function can be used to customize the default sensor connection
* by connecting one or more pins to an existing sensor as an Rx electrode
* prior to initiating scan of the sensor.
*
* The function ignores whether the sensor is a ganged sensor and
* connects only a specified port pin to the CSD HW block. This function can
* only use GPIOs that is already assigned to CAPSENSE&trade; middleware.
*
* The functions that perform a setup and scan of a sensor/widget do not
* take into account changes in the design made by
* the Cy_CapSense_CSXConnectRx() function. Hence all GPIOs connected
* using this function must be disconnected using
* the Cy_CapSense_CSXDisconnectRx() function prior to initializing
* new widgets. Use this function in StartSample
* callback (see the \ref group_capsense_callbacks section for details)
* or with low-level functions that perform a single-sensor scanning.
*
* Scanning should be completed before calling this function.
*
* \param rxPtr
* Specifies the pointer to the cy_stc_capsense_pin_config_t object belonging to
* a sensor which to be connected to the CSD HW block as an Rx electrode.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
* \funcusage
*
* An example of using the function to perform port pin re-connection:
* \snippet capsense/snippet/main.c snippet_Cy_CapSense_CSXConnect
*
*******************************************************************************/
void Cy_CapSense_CSXConnectRx(
                const cy_stc_capsense_pin_config_t * rxPtr,
                const cy_stc_capsense_context_t * context)
{
    (void) context;
    Cy_CapSense_SsConfigPinRegisters(rxPtr->pcPtr, (uint32_t)rxPtr->pinNumber, CY_CAPSENSE_DM_GPIO_ANALOG, CY_CAPSENSE_HSIOM_SEL_AMUXA);
}


