RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/capsense/cy_capsense_csx_v2.c
/*******************************************************************************
* Function Name: Cy_CapSense_CSXScanISR
****************************************************************************//**
*
* This is an internal ISR function to handle the CSX sensing method operation.
*
* This handler covers the following functionality:
* - Read the result of the measurement and store it into the corresponding register of
* the data structure.
* - If the Noise Metric functionality is enabled, then check the number of bad
* conversions and repeat the scan of the current sensor if the number of bad
* conversions is greater than the Noise Metric Threshold.
* - Initiate the scan of the next sensor for multiple sensor scanning mode.
* - Update the Status register in the data structure.
* - Switch the HW IP block to the default state if scanning of all the sensors is
* completed.
*
* \param capsenseContext
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
*******************************************************************************/
void Cy_CapSense_CSXScanISR(void * capsenseContext)
{
    uint32_t tmpRawCount;
    cy_stc_capsense_context_t * cxt = (cy_stc_capsense_context_t *)capsenseContext;
    const cy_stc_active_scan_sns_t * ptrActive = cxt->ptrActiveScanSns;
    uint32_t maxCount = (uint32_t) ptrActive->ptrWdContext->maxRawCount;

    cxt->ptrCommonConfig->ptrCsdBase->INTR_MASK = CY_CAPSENSE_CSD_INTR_MASK_CLEAR_MSK;

    /* Clear all pending interrupts of the CSD HW block */
    cxt->ptrCommonConfig->ptrCsdBase->INTR = CY_CAPSENSE_CSD_INTR_ALL_MSK;
    (void)cxt->ptrCommonConfig->ptrCsdBase->INTR;


    tmpRawCount  = (uint16_t)(cxt->ptrCommonConfig->ptrCsdBase->RESULT_VAL1 &
                                             CY_CAPSENSE_CSD_RESULT_VAL1_VALUE_MSK);

    tmpRawCount += (uint16_t)(cxt->ptrCommonConfig->ptrCsdBase->RESULT_VAL2 &
                                             CY_CAPSENSE_CSD_RESULT_VAL2_VALUE_MSK);

    /* This workaround needed to prevent overflow in the SW register map. ID #234358 */
    if(tmpRawCount > maxCount)
    {
        tmpRawCount = maxCount;
    }
    ptrActive->ptrSnsContext->raw = (uint16_t) (maxCount - tmpRawCount);

    #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_MULTI_FREQUENCY_SCAN_EN)
        /* Either complete scan or initiate new one */
        if(ptrActive->mfsChannelIndex < CY_CAPSENSE_MFS_CH2_INDEX)
        {
            Cy_CapSense_CSXInitNextChScan(cxt);
        }
        else if (CY_CAPSENSE_SCAN_SCOPE_SNGL_SNS == ptrActive->scanScope)
        {
            Cy_CapSense_ClrBusyFlags(cxt);
            cxt->ptrCommonConfig->ptrCsdBase->CONFIG = cxt->ptrInternalContext->csxRegConfigInit;
            cxt->ptrCommonConfig->ptrCsdBase->CSDCMP = CY_CAPSENSE_DEFAULT_CSD_CSDCMP_CFG;
            cxt->ptrCommonConfig->ptrCsdBase->IDACA = CY_CAPSENSE_DEFAULT_CSD_IDACA_CFG;
        }
        else
        {
            /* Disconnect Tx electrodes of previously scanned sensor as preparation for next sensor scan */
            Cy_CapSense_CSXDisconnectTxExt(cxt);
            /* Scan the next sensor */
            Cy_CapSense_CSXInitNextScan(cxt);
        }
    #else
        if (CY_CAPSENSE_SCAN_SCOPE_SNGL_SNS == ptrActive->scanScope)
        {
            Cy_CapSense_ClrBusyFlags(cxt);
            cxt->ptrCommonConfig->ptrCsdBase->CONFIG = cxt->ptrInternalContext->csxRegConfigInit;
            cxt->ptrCommonConfig->ptrCsdBase->CSDCMP = CY_CAPSENSE_DEFAULT_CSD_CSDCMP_CFG;
            cxt->ptrCommonConfig->ptrCsdBase->IDACA = CY_CAPSENSE_DEFAULT_CSD_IDACA_CFG;
        }
        else
        {
            /* Disconnect Tx electrodes of previously scanned sensor as preparation for next sensor scan */
            Cy_CapSense_CSXDisconnectTxExt(cxt);
            /* Scan the next sensor */
            Cy_CapSense_CSXInitNextScan(cxt);
        }
    #endif

}


/*******************************************************************************
* Function Name: Cy_CapSense_CSXInitNextScan
****************************************************************************//**
*
* This function initializes the next sensor scan.
*
* The function increments the sensor index, updates sense clock for matrix
* or touchpad widgets only, sets up Compensation IDAC, enables the sensor and
* scans it. When all the sensors are scanned it continues to set up the next
* widget until all the widgets are scanned.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
*******************************************************************************/
static void Cy_CapSense_CSXInitNextScan(cy_stc_capsense_context_t * context)
{
    cy_stc_active_scan_sns_t * ptrActive = context->ptrActiveScanSns;

    ptrActive->mfsChannelIndex = 0u;
    ptrActive->ptrSnsContext = &ptrActive->ptrWdConfig->ptrSnsContext[ptrActive->sensorIndex];

    /* Increment sensor index and sensor's context pointer to scope next sensor in widget */
    ptrActive->sensorIndex++;
    ptrActive->ptrSnsContext++;
    /* Initiate scan for next sensor in widget, if all the sensors in widget are not scanned */
    ptrActive->txIndex--;

        if (ptrActive->txIndex > 0u)
        {
            /* Increment pointer to the next Tx electrode and connect it for scan  */
            ptrActive->ptrTxConfig++;
            Cy_CapSense_CSXConnectTxExt(context);
            /* Initiate a next scan */
            Cy_CapSense_CSXSetUpIdacs(context);
            Cy_CapSense_CSXStartSample(context);
        }
        /* Check whether all Rx are looped through */
        else
        {
            ptrActive->rxIndex--;
            if (ptrActive->rxIndex > 0u)
            {
                /* Disconnect the current Rx electrode and connect a next Rx electrode */
                Cy_CapSense_CSXDisconnectRxExt(context);
                ptrActive->ptrRxConfig++;
                Cy_CapSense_CSXConnectRxExt(context);
                /* Re-initialize Tx index to be scanned per Rx and connect the first Tx electrode again */
                ptrActive->txIndex = ptrActive->ptrWdConfig->numRows;
                ptrActive->ptrTxConfig = &ptrActive->ptrWdConfig->ptrEltdConfig[ptrActive->ptrWdConfig->numCols];
                Cy_CapSense_CSXConnectTxExt(context);
                /* Initiate a next scan */
                Cy_CapSense_CSXSetUpIdacs(context);
                Cy_CapSense_CSXStartSample(context);
            }
            else
            {
                /* If all the sensors are scanned, disconnect the last Rx electrode */
                Cy_CapSense_CSXDisconnectRxExt(context);
                ptrActive->connectedSnsState = CY_CAPSENSE_SNS_DISCONNECTED;
                /* Call scan of next widget if requested. If not, complete scan */
                if (0u != (ptrActive->scanScope & CY_CAPSENSE_SCAN_SCOPE_ALL_WD_MASK))
                {
                    Cy_CapSense_SsPostAllWidgetsScan(context);
                }
                else
                {
                    /* All pending scans completed, clear busy state as scanning is completed  */
                    Cy_CapSense_ClrBusyFlags(context);
            }
        }
    }
}


